#+TITLE: HDF5 I/O Test

** CMake

CMake package discovery works most of the time, but needs help in
highly-customized environments. Use the ~HDF5_ROOT~ and ~UUID_ROOT~ variables to
be specific.

#+begin_src shell :results verbatim

mkdir -p ./build
cd ./build
rm -rf *
cmake -D HDF5_ROOT:PATH=~/.local \
      -D UUID_ROOT:PATH=/gnu/store/a45p39mgqvfd8kjwibyr0q42k1mw7gmf-util-linux-2.35.1-lib \
      ../
make

#+end_src

#+RESULTS:
#+begin_example
-- The C compiler identification is GNU 11.1.0
-- Detecting C compiler ABI info
-- Detecting C compiler ABI info - done
-- Check for working C compiler: /home/gerd/.guix-profile/bin/gcc - skipped
-- Detecting C compile features
-- Detecting C compile features - done
-- HDF5 C compiler wrapper is unable to compile a minimal HDF5 program.
-- Found HDF5: /home/gerd/.local/lib/libhdf5.so (found version "1.13.0")
-- Found MPI_C: /home/gerd/.guix-profile/lib/libmpi.so (found version "3.1")
-- Found MPI: TRUE (found version "3.1")
-- Found UUID: /gnu/store/a45p39mgqvfd8kjwibyr0q42k1mw7gmf-util-linux-2.35.1-lib/lib/libuuid.so
-- Configuring done
-- Generating done
-- Build files have been written to: /home/gerd/scratch/hdf5-iotest/build
[ 12%] Building C object src/CMakeFiles/hdf5_iotest.dir/configuration.c.o
[ 25%] Building C object src/CMakeFiles/hdf5_iotest.dir/dataset.c.o
[ 37%] Building C object src/CMakeFiles/hdf5_iotest.dir/hdf5_iotest.c.o
[ 50%] Building C object src/CMakeFiles/hdf5_iotest.dir/ini.c.o
[ 62%] Building C object src/CMakeFiles/hdf5_iotest.dir/read_test.c.o
[ 75%] Building C object src/CMakeFiles/hdf5_iotest.dir/utils.c.o
[ 87%] Building C object src/CMakeFiles/hdf5_iotest.dir/write_test.c.o
[100%] Linking C executable ../bin/hdf5_iotest
[100%] Built target hdf5_iotest
#+end_example

The ~hdf5_iotest~ binary will be located in ~./build/bin~.

#+begin_src shell :results output
ls -al ./build/bin
#+end_src

#+RESULTS:
: total 68
: drwxr-xr-x 2 gerd users  4096 Jul 30 11:12 .
: drwxr-xr-x 5 gerd users  4096 Jul 30 11:12 ..
: -rwxr-xr-x 1 gerd users 59672 Jul 30 11:12 hdf5_iotest

